{"keras_version": "2.0.2", "config": [{"config": {"batch_input_shape": [null, 40, 35], "layer": {"config": {"recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "use_bias": true, "trainable": true, "name": "lstm_1", "kernel_constraint": null, "go_backwards": false, "recurrent_dropout": 0.0, "kernel_regularizer": null, "bias_regularizer": null, "activation": "tanh", "activity_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "dropout": 0.0, "implementation": 0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unroll": false, "return_sequences": false, "recurrent_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "stateful": false}, "class_name": "LSTM"}, "name": "bidirectional_1", "merge_mode": "concat", "trainable": true, "dtype": "float32"}, "class_name": "Bidirectional"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 40, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}